requiredModules/sampleCaseSet_channelFlow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
120
(
(1.09649 -1.58646e-07 0)
(1.09556 -4.23215e-07 0)
(1.09374 -1.13239e-07 0)
(1.09102 -7.31963e-08 0)
(1.08735 -7.11774e-07 0)
(1.08266 -3.54769e-07 0)
(1.07686 9.17136e-07 0)
(1.06989 1.2045e-06 0)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sides1_half01
    {
        type            empty;
    }
    sides1_half11
    {
        type            empty;
    }
    sides2_half01
    {
        type            empty;
    }
    sides2_half11
    {
        type            empty;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inout1_half0
    {
        type            cyclic;
    }
    inout1_half1
    {
        type            cyclic;
    }
    inout2_half0
    {
        type            cyclic;
    }
    inout2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
