requiredModules/sampleCaseSet_channelFlow/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
120
(
0.00202493
0.00205318
0.00210652
0.00218447
0.00228709
0.00241503
0.00256819
0.00274512
...
)
;

boundaryField
{
    bottomWall
    {
        type            kqRWallFunction;
        value           uniform 3.83002e-06;
    }
    sides1_half01
    {
        type            empty;
    }
    sides1_half11
    {
        type            empty;
    }
    sides2_half01
    {
        type            empty;
    }
    sides2_half11
    {
        type            empty;
    }
    topWall
    {
        type            kqRWallFunction;
        value           uniform 3.85434e-06;
    }
    inout1_half0
    {
        type            cyclic;
    }
    inout1_half1
    {
        type            cyclic;
    }
    inout2_half0
    {
        type            cyclic;
    }
    inout2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
