requiredModules/sampleCaseSet_channelFlow/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
120
(
1.11248e-10
1.82548e-05
5.50616e-05
0.000110529
0.00018373
0.000273626
0.000378804
0.000495963
...
)
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    sides1_half01
    {
        type            empty;
    }
    sides1_half11
    {
        type            empty;
    }
    sides2_half01
    {
        type            empty;
    }
    sides2_half11
    {
        type            empty;
    }
    topWall
    {
        type            zeroGradient;
    }
    inout1_half0
    {
        type            cyclic;
    }
    inout1_half1
    {
        type            cyclic;
    }
    inout2_half0
    {
        type            cyclic;
    }
    inout2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
